/*--------------------------------文*件*信*息-----------------------------
* 文件名：  _Type.h
* 版　本：  v1.0
* 描  述：  100T双轴 整合后的版本
* 创建人：   
* 日  期：   
--------------------------------------------------------------------------
*当前版本:	v1.0
*修 改 人:
*日　  期:
----------------------------------修改履历--------------------------------
1、
2、
3、
4、
------------------------------------------------------------------------*/
    #ifndef _TYPE_H_

	#define _TYPE_H_
//----------------------------------------------------
//数据类型重定义	
	#define int8u  unsigned char
	#define int16u unsigned int
	#define int32u unsigned long int
	#define int8s  signed char
	#define int16s signed int
	#define int32s signed long int
//-----------------------------------------------
#endif
