/*--------------------------------文*件*信*息-----------------------------
* 文件名：  Key.c
* 版　本：  v1.0
* 描  述：  100T双轴 整合后的版本
* 创建人：   
* 日  期：   
--------------------------------------------------------------------------
*当前版本:	v1.0
*修 改 人:
*日　  期:
----------------------------------修改履历--------------------------------
1、
2、
3、
4、
------------------------------------------------------------------------*/
#define  __KEY_C__
#include  "_Include.h"
//***********************************************************************/
// *功    能：
// *入    口：
// *出    口：
// *备    注：
// *函数性质：
//***********************************************************************/
#if 0
static int8u Key_Down(void)
{   static int16u xdata KeyTime=0;//mS


    KEY_IO=1;
    delay_cyc(1);
    if(KEY_IO!=1)
    {   if(KeyTime>KEY_TIME) return(FALSE);
        KeyTime++;
        if(KeyTime==KEY_TIME)
        return(TRUE);
        else
        return(FALSE);
    }
    else
    {   KeyTime=0;
        return(FALSE);
    }
}
//***********************************************************************/

void Key_Proc(void)
{
	if (FALSE == KeyEnb) return;
    if(TRUE == Key_Down())
    {
        SetAngXUsrZero(GetAngXRelSys());
        SetAngYUsrZero(GetAngYRelSys());    //用户置0);    //HXL 12/8/26整合更新
        Comm_PutStr("set zero",8);
        Sub_SendOk();
        Flash_UserDataUpdate();				//清零一次，保存一次数据
    }
}
#endif
//***********************************************************************/

